Repository: AndreiTupikov/AndHowIsItApp
Catalog: AndHowIsItApp/Resources/Language.*.resx
Languages: ru

source: Add
ru: Добавить

source: Add Comment
ru: Добавить комментарий

source: Add review
ru: Добавить обзор

source: Admin rights
ru: Права администратора

source: All Categories
ru: Все категории

# ApplicationName
source: And How Is It?
ru: Ну и Как Оно?

source: Author
ru: Автор

# AuthorRatingAsc
source: By author rating, from lowest to highest
ru: По оценке автора, от меньшей к большей

# AuthorRatingDesc
source: By author rating, from highest to lowest
ru: По оценке автора, от большей к меньшей

# AuthorsRating
source: Piece of art rating
ru: Оценка произведения

# BestReviews
source: Best reviews of all time
ru: Лучшие обзоры за все время

source: Block
ru: Блокировать

source: Block/Unblock
ru: Блокир./Разблок.

source: Books
ru: Книги

source: Cancel
ru: Отмена

source: Categories
ru: Категории

source: Category
ru: Категория

# CategoryRequiredError
source: Select a category
ru: Выберите категорию

source: Changed
ru: Изменено

source: Comments
ru: Комментарии

source: Created
ru: Создано

source: Dark theme
ru: Темная тема

# DateAsc
source: By add date, from earliest to latest
ru: По дате добавления, от ранних к поздним

# DateDesc
source: By add date, from latest to earliest
ru: По дате добавления, от поздних к ранним

source: Delete
ru: Удалить

# DeleteConfirm
source: Delete confirmation
ru: Подтверждение удаления

source: Delete review
ru: Удалить обзор

# DeleteReviewConfirmText
source: Are you sure you want to delete the review
ru: Вы действительно хотите удалить обзор

# DeleteUserConfirmText
source: Are you sure you want to delete user
ru: Вы действительно хотите удалить пользователя

source: Edit
ru: Изменить

source: Edit review
ru: Изменить обзор

# EditReviewConfirm
source: Edit confirmation
ru: Подтверждение изменений

# EditReviewConfirmText
source: Do you want to edit review
ru: Вы хотите изменить обзор

source: Email
ru: Почта

source: Email Address
ru: Адрес электронной почты

# EmailRequiredError
source: Email Address field is required
ru: Поле Адрес электронной почты обязательно

# GiveRights
source: Give admin rights
ru: Дать права

source: Latest reviews
ru: Последние обзоры

source: Light theme
ru: Светлая тема

# LikesAsc
source: By likes count, from lowest to highest
ru: По количеству лайков, от меньшего к большему

# LikesDesc
source: By likes count, from highest to lowest
ru: По количеству лайков, от большего к меньшему

# LockedOut
source: This account has been blocked. Please try again later
ru: Эта учетная запись заблокирована. Попробуйте еще раз позже

source: Log Out
ru: Выйти

source: Movies
ru: Фильмы

source: My Page
ru: Моя страница

source: My reviews
ru: Мои обзоры

# OtherReviews
source: Other reviews for this piece of art
ru: Другие обзоры на это произведение

source: Personal page
ru: Личная страница

# Picture
source: Image(*optional)
ru: Изображние(*не обязательно)

# PictureExtensionError
source: The file extension must be .jpg or .jpeg
ru: Расширение файла должно быть .jpg или .jpeg

# PictureSizeError
source: The file size must not exceed 2 MB
ru: Размер файла не должен превышать 2 МБ

# PieceOfArtRating
source: Average piece of art rating
ru: Средняя оценка произведения

# RatingRangeError
source: The rating must be between 1 and 10
ru: Оценка произведения должна быть от 1 до 10

# RatingRequiredError
source: Rate the piece of art
ru: Поставьте свою оценку произведению

source: Register
ru: Регистрация

# RegisterWith
source: Register with your account
ru: Регистрация с вашей учетной записью

# RequestError
source: An error occurred while processing the request
ru: При обработке запроса произошла ошибка

# RevokeRights
source: Revoke admin rights
ru: Отнять права

source: Role
ru: Роль

source: Search
ru: Поиск

# SearchResults
source: Results on request
ru: Результаты по запросу

source: Show
ru: Показать

source: Sign In
ru: Выполнить вход

# SignInConfirm
source: Enter your username, email address and click the "Register" button to complete sign in
ru: Введите имя пользователя, адрес электронной почты и нажмите кнопку "Регистрация", чтобы завершить вход

# SignInFail
source: Failed to login using the service
ru: Не удалось войти через службу

# SignInServicesList
source: Use one of the services to sign in
ru: Используйте для входа одну из служб

source: Sign in with
ru: Войти с помощью учетной записи

# SortBy
source: Sort
ru: Сортировать

# Subject
source: Piece of art
ru: Название произведения

# SubjectLengthError
source: The title of the piece of art must be within 50 characters
ru: Название произведения должно быть в пределах 50 символов

# SubjectRateAsc
source: By piece of art rating, from lowest to highest
ru: По рейтингу произведения, от меньшего к большему

# SubjectRateDesc
source: By piece of art rating, from highest to lowest
ru: По рейтингу произведения, от большего к меньшему

# SubjectRequiredError
source: Enter the title of the piece of art
ru: Введите название произведения

# SuccessAuth
source: You have successfully authenticated through
ru: Вы успешно прошли проверку подлинности через

source: Tags
ru: Теги

# Text
source: Review text
ru: Текст обзора

# TextRequiredError
source: Enter review text
ru: Введите текст обзора

source: Theme
ru: Тема

# Title
source: Review title
ru: Название обзора

# TitleLengthError
source: Review title must be within 50 characters
ru: Название обзора должно быть в пределах 50 символов

# TitleRequiredError
source: Enter review title
ru: Введите название обзора

source: Unblock
ru: Разблокировать

source: User Name
ru: Имя пользователя

# UserNameRequiredError
source: User Name field is required
ru: Поле Имя пользователя обязательно

source: Users List
ru: Список пользователей

source: Video Games
ru: Игры

source: View
ru: Просмотр

# YourPieceOfArtRating
source: Your rating of the piece of art
ru: Ваша оценка произведению
